_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатРабочееВремяСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>уатРабочееВремяСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Comment>Всегда = 1 (Нужен для выгрузки в ЗУП)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/ТипыТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ТипыТранспортныхСредств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоподъемностьВТоннах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьВКубическихМетрах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидТС</Name>
					<Comment>Вид ТС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатСамосвал</Name>
					<Comment>Является самосвалом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатПолезныйРазмерВысота</Name>
					<Comment>Полезная высота</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатПолезныйРазмерДлина</Name>
					<Comment>Полезная длина</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатПолезныйРазмерШирина</Name>
					<Comment>Полезная ширина</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатТипКузова</Name>
					<Comment>Тип кузова</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УзлыОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УзлыОбъектовЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыЭксплуатации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подкласс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодклассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВлияетНаДоступностьРЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РемонтирующееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принадлежность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУчетаНаработок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначенныйРесурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмещениеЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/уатИнтеграцияСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Переопределяемые процедуры, вызываемые из обработчиков типовых форм.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - форма, из обработчика события которой происходит вызов процедуры.
//	см. справочную информацию по событиям управляемой формы.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.ТипыТранспортныхСредств.Форма.ФормаЭлемента" Тогда 
		ТипыТСФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ТипыТранспортныхСредств.Форма.ФормаСписка" Тогда 
		ТипыТСФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ТипыТранспортныхСредств.Форма.ФормаВыбора" Тогда 
		ТипыТСФормаВыбораПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ТранспортныеСредства.Форма.ФормаЭлемента" Тогда
		ТранспортныеСредстваФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.ТранспортныеСредства.Форма.ФормаВыбора" Тогда
		ТранспортныеСредстваФормаВыбораПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.УзлыОбъектовЭксплуатации.Форма.ФормаЭлемента" Тогда
		УзлыОбъектовЭксплуатацииФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в ТЧ документа "Табель учета рабочего времени" данные отработанного сотрудниками времени по Путевым листам
Процедура ЗаполнитьТабельПоДаннымПЛ(ЭтаФорма, ОчищатьПерезЗаполнением = Ложь) Экспорт
	Объект = ЭтаФорма.Объект;
		
	ОМ_УчетРабочегоВремениРасширенный = ОбщегоНазначения.ОбщийМодуль("УчетРабочегоВремениРасширенный");
	ОМ_УчетРабочегоВремениРасширенныйКлиентСервер = ОбщегоНазначения.ОбщийМодуль("УчетРабочегоВремениРасширенныйКлиентСервер");
	ОМ_УчетРабочегоВремениРасширенныйФормы = ОбщегоНазначения.ОбщийМодуль("УчетРабочегоВремениРасширенныйФормы");
	
	КодыВидовВремени = ОМ_УчетРабочегоВремениРасширенный.КодыВидовВремени(Объект.ПериодРегистрации);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатРабочееВремяСотрудниковОбороты.Сотрудник КАК Сотрудник,
	|	1 КАК Дни,
	|	уатРабочееВремяСотрудниковОбороты.ВремяОборот / 3600 КАК Часы,
	|	уатРабочееВремяСотрудниковОбороты.ДатаРаботы КАК Дата,
	|	уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени КАК ВидУчетаВремени,
	|	ВЫБОР
	|		КОГДА уатРабочееВремяСотрудниковОбороты.ВидИспользованияРабочегоВремени = &Явка
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрНакопления.уатРабочееВремяСотрудников.Обороты(&Начало, &Конец, , Организация = &Организация) КАК уатРабочееВремяСотрудниковОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Дата,
	|	Приоритет");
	Запрос.УстановитьПараметр("Начало", Объект.ДатаНачалаПериода);
	Запрос.УстановитьПараметр("Конец", Объект.ДатаОкончанияПериода);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Явка", ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Явка"));
	
	ВыборкаДанныхОВремени = Запрос.Выполнить().Выбрать();
	
	ТекущийСотрудник = Неопределено;
	ДанныеОВремениПоСотруднику = Новый Массив;
	
	НомерСтрокиСотрудник = 1;
	Для Каждого ТекСтрока Из Объект.ДанныеОВремени Цикл
		НомерСтрокиСотрудник = Макс(НомерСтрокиСотрудник, ТекСтрока.НомерСтрокиСотрудник+1);
	КонецЦикла;
	
	Если ОчищатьПерезЗаполнением Тогда
		Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Сотрудник") Цикл
			мсвСтрокиУдалить = Объект.ДанныеОВремени.НайтиСтроки(Новый Структура("Сотрудник", ВыборкаДанныхОВремени.Сотрудник));
			Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл
				Объект.ДанныеОВремени.Удалить(ТекСтрокаУдалить);
			КонецЦикла;
		КонецЦикла;
		ВыборкаДанныхОВремени.Сбросить();
	КонецЕсли;
		
	ДанныеОВремениПоСотруднику = Новый ТаблицаЗначений;
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Сотрудник");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("ВидУчетаВремени");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Дата");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Дни");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("Часы");
	ДанныеОВремениПоСотруднику.Колонки.Добавить("НормаЧасов");
	
	Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеОВремениПоСотруднику.Очистить();
		Пока ВыборкаДанныхОВремени.Следующий() Цикл
			СтрокаТаблицыДанныхОВремени = ДанныеОВремениПоСотруднику.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДанныхОВремени, ВыборкаДанныхОВремени);
		КонецЦикла;
		МассивСтрокПоСотруднику = Объект.ДанныеОВремени.НайтиСтроки(Новый Структура("Сотрудник", ВыборкаДанныхОВремени.Сотрудник));
		Если МассивСтрокПоСотруднику.Количество() = 0 Тогда
			МассивСтрокПоСотруднику = ТабельНоваяСтрокаДанныхОВремени(Объект.ДанныеОВремени,
				ВыборкаДанныхОВремени.Сотрудник, НомерСтрокиСотрудник, ЭтаФорма.УстанавливаемаяВысотаСтроки);
			НомерСтрокиСотрудник = НомерСтрокиСотрудник + 1;
		КонецЕсли;
		
		ТабельЗаполнитьСтрокиПоСотруднику(Объект, ДанныеОВремениПоСотруднику, МассивСтрокПоСотруднику, КодыВидовВремени, ЭтаФорма.ОписаниеВидовВремени, ЭтаФорма.УстанавливаемаяВысотаСтроки);
	КонецЦикла;
	
	ОМ_УчетРабочегоВремениРасширенныйФормы.ТабельУстановитьВысотуСтрокПоСотрудникам(ЭтаФорма, ЭтаФорма.УстанавливаемаяВысотаСтроки);
	
	ОбозначенияВидовВремени = ОМ_УчетРабочегоВремениРасширенныйКлиентСервер.ТабельОбозначенияВидовВремени(ЭтаФорма.ОписаниеВидовВремени);
	СтрокиПоСотруднику = Новый Массив;                                                                                                                        
	ТекущийСотрудник = Неопределено;
	Для Каждого СтрокаДанныхОВремени Из Объект.ДанныеОВремени Цикл
		Если СтрокаДанныхОВремени.Сотрудник <> ТекущийСотрудник
			И СтрокиПоСотруднику.Количество() > 0 Тогда
			ОМ_УчетРабочегоВремениРасширенныйКлиентСервер.ТабельЗаполнитьИтогиПоСотруднику(СтрокиПоСотруднику, ОбозначенияВидовВремени);
			СтрокиПоСотруднику = Новый Массив;
			СтрокиПоСотруднику.Добавить(СтрокаДанныхОВремени);
			ТекущийСотрудник = СтрокаДанныхОВремени.Сотрудник;
		Иначе
			СтрокиПоСотруднику.Добавить(СтрокаДанныхОВремени);
			ТекущийСотрудник = СтрокаДанныхОВремени.Сотрудник;
		КонецЕсли;
	КонецЦикла;
	Если СтрокиПоСотруднику.Количество() > 0 Тогда
		ОМ_УчетРабочегоВремениРасширенныйКлиентСервер.ТабельЗаполнитьИтогиПоСотруднику(СтрокиПоСотруднику, ОбозначенияВидовВремени);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ТипыТСФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	// Вывод на форму реквизита "уатВидТС".
	ЭлементУатВидТС = Форма.Элементы.Добавить("_уатВидТС", Тип("ПолеФормы"), Форма);
	ЭлементУатВидТС.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементУатВидТС.ПутьКДанным = "Объект.уатВидТС";
	
	// Вывод на форму реквизита "уатТипКузова".
	ЭлементУатТипКузова = Форма.Элементы.Добавить("_уатТипКузова", Тип("ПолеФормы"), Форма);
	ЭлементУатТипКузова.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементУатТипКузова.ПутьКДанным = "Объект.уатТипКузова";
	
	// Вывод на форму флага "уатСамосвал"
	ЭлементУатСамосвал = Форма.Элементы.Добавить("_уатСамосвал", Тип("ПолеФормы"), Форма);
	ЭлементУатСамосвал.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементУатСамосвал.ПутьКДанным = "Объект.уатСамосвал";
		
	// Вывод на форму группы реквизитов уатГруппаПолезныеРазмеры
	ЭлементУатГруппаПолезныеРазмеры = Форма.Элементы.Добавить("_уатГруппаПолезныеРазмеры", Тип("ГруппаФормы"), Форма);
	ЭлементУатГруппаПолезныеРазмеры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементУатГруппаПолезныеРазмеры.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ЭлементУатГруппаПолезныеРазмеры.Заголовок = "Полезные размеры";
	ЭлементУатГруппаПолезныеРазмеры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ЭлементУатПолезнаяДлина = Форма.Элементы.Добавить("_уатПолезнаяДлина", Тип("ПолеФормы"), ЭлементУатГруппаПолезныеРазмеры);
	ЭлементУатПолезнаяДлина.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементУатПолезнаяДлина.ПутьКДанным = "Объект.уатПолезныйРазмерДлина";
	
	ЭлементУатПолезнаяВысота = Форма.Элементы.Добавить("_уатПолезнаяВысота", Тип("ПолеФормы"), ЭлементУатГруппаПолезныеРазмеры);
	ЭлементУатПолезнаяВысота.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементУатПолезнаяВысота.ПутьКДанным = "Объект.уатПолезныйРазмерВысота";
	
	ЭлементУатПолезнаяШирина = Форма.Элементы.Добавить("_уатПолезнаяШирина", Тип("ПолеФормы"), ЭлементУатГруппаПолезныеРазмеры);
	ЭлементУатПолезнаяШирина.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементУатПолезнаяШирина.ПутьКДанным = "Объект.уатПолезныйРазмерШирина";
	
КонецПроцедуры

Процедура ТипыТСФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	ДобавитьЗаполнениеИзКлассификатораТСНаФорму(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ТипыТСФормаВыбораПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	ДобавитьЗаполнениеИзКлассификатораТСНаФорму(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ДобавитьЗаполнениеИзКлассификатораТСНаФорму(Форма, Отказ, СтандартнаяОбработка)
	
	Если Форма.ИмяФормы <> "Справочник.ТипыТранспортныхСредств.Форма.ФормаСписка" 
		И Форма.ИмяФормы <> "Справочник.ТипыТранспортныхСредств.Форма.ФормаВыбора" Тогда
		Возврат;
	КонецЕсли;
	
	// Добавление команды формы заполнения справочника по классификатору
	КомандаУатЗаполнитьПоКлассификатору = Форма.Команды.Добавить("_уатЗаполнитьПоКлассификаторуТиповТС");
	КомандаУатЗаполнитьПоКлассификатору.Заголовок = "По классификаторам";
	КомандаУатЗаполнитьПоКлассификатору.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	КомандаУатЗаполнитьПоКлассификатору.Подсказка = "Подобрать по классификаторам";

	// Поиск в панели функция стандартной команды создания нового элемента
	КнопкаСоздать = Форма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаСоздать");
	
	Если КнопкаСоздать <> Неопределено Тогда
		
		// Создание подменю "Создать" на командной панели
		ЭлементУатГруппаСоздать = Форма.Элементы.Вставить("_уатГруппаСоздать", Тип("ГруппаФормы"), Форма.КоманднаяПанель, КнопкаСоздать);
		ЭлементУатГруппаСоздать.Вид = ВидГруппыФормы.Подменю;
		ЭлементУатГруппаСоздать.Заголовок = "Создать";
		
		// Добавление в подменю кнопки заполнения по классифактору
		ЭлементУатКнопкаЗаполнитьПоКлассификатору = Форма.Элементы.Добавить("_уатКнопкаЗаполнитьПоКлассификатору", Тип("КнопкаФормы"), ЭлементУатГруппаСоздать);
		ЭлементУатКнопкаЗаполнитьПоКлассификатору.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		ЭлементУатКнопкаЗаполнитьПоКлассификатору.ИмяКоманды = "_уатЗаполнитьПоКлассификаторуТиповТС";
		
		// Перенос в подменю "Создать" стандартной кнопки "Создать"
		Форма.Элементы.Переместить(КнопкаСоздать, ЭлементУатГруппаСоздать);
		
	Иначе
		
		// Если найти стандуртную команду не получилось, то просто добавляем кнопку заполнения по классификатору на командную панель
		ЭлементУатКнопкаЗаполнитьПоКлассификатору = Форма.Элементы.Добавить("_уатКнопкаЗаполнитьПоКлассификатору", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
		ЭлементУатКнопкаЗаполнитьПоКлассификатору.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		ЭлементУатКнопкаЗаполнитьПоКлассификатору.ИмяКоманды = "_уатЗаполнитьПоКлассификаторуТиповТС";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТранспортныеСредстваФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не Метаданные.Константы.Найти("ИспользоватьУправлениеДоставкой") = Неопределено Тогда 
		Если Не Константы.ИспользоватьУправлениеДоставкой.Получить() Тогда 
			Отказ = Истина;
			ТекстОшибки = "Для использования справочника ""Транспортные средства"" необходимо включить использование подсистемы ""Управление доставкой"" в панели ""Администрирование"", раздел ""Склад и доставка"".";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			УстановитьПривилегированныйРежим(Ложь);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	// Вывод на форму элементов для перехода к форме реквизитов модуля УАТ.
	ЭлементГруппаФормаУАТТС = Форма.Элементы.Добавить("_уатГруппаДопСвойствТС", Тип("ГруппаФормы"), Форма);
	ЭлементГруппаФормаУАТТС.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаФормаУАТТС.ЦветФона = Новый Цвет(247, 247, 247);
	ЭлементГруппаФормаУАТТС.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаФормаУАТТС.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	ЭлементГруппаФормаУАТТС.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	ЭлементГруппаФормаУАТТС.Высота = 4;
	ЭлементГруппаФормаУАТТС.Ширина = 39;
	
	ЭлементКартинкаФормаУАТТС = Форма.Элементы.Добавить("_уатГруппаДопСвойствТСКартинка", Тип("ДекорацияФормы"), ЭлементГруппаФормаУАТТС);
	ЭлементКартинкаФормаУАТТС.Вид = ВидДекорацииФормы.Картинка;
	ЭлементКартинкаФормаУАТТС.Картинка = БиблиотекаКартинок.уатЛоготипПриложения;
		
	ЭлементНадписьФормаУАТТС = Форма.Элементы.Добавить("_уатГруппаДопСвойствТСНадпись", Тип("ДекорацияФормы"), ЭлементГруппаФормаУАТТС);
	ЭлементНадписьФормаУАТТС.Вид = ВидДекорацииФормы.Надпись;
	ЭлементНадписьФормаУАТТС.Заголовок = "Дополнительные реквизиты модуля" + Символы.ПС + """Управление автотранспортом""";
		
	кОткрытьФормуДопСвойств = Форма.Команды.Добавить("_уатФормаДопСвойствТС");
	кОткрытьФормуДопСвойств.Заголовок = "Открыть";
	кОткрытьФормуДопСвойств.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	кОткрытьФормуДопСвойств.Подсказка = "Открыть форму дополнительных реквизитов модуля ""Управление автотранспортом"".";
	
	ЭлементКнопкаФормаУАТТС = Форма.Элементы.Добавить("_уатГруппаДопСвойствТСКнопка", Тип("КнопкаФормы"), ЭлементГруппаФормаУАТТС);
	ЭлементКнопкаФормаУАТТС.ИмяКоманды = "_уатФормаДопСвойствТС";
	
	// Определение поведения элемента при копировании.
	Если Форма.Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Форма.Параметры.ЗначениеКопирования) Тогда 
		Форма.Объект.Код                                      = "";
		Форма.Объект.Наименование                             = "";
		Форма.Объект.уатМодель                                = Неопределено;
		Форма.Объект.уатВидМоделиТС                           = Неопределено;
		Форма.Объект.уатДатаВводаВЭксплуатацию                = '00010101';
		Форма.Объект.уатДатаВыбытия                           = '00010101';
		Форма.Объект.уатОрганизация                           = Неопределено;
		Форма.Объект.уатПодразделение                         = Неопределено;
		Форма.Объект.уатКолонна                               = Неопределено;
		Форма.Объект.ЛицензионнаяКарточкаВид                  = Неопределено;
		Форма.Объект.ЛицензионнаяКарточкаНомер                = Неопределено;
		Форма.Объект.ЛицензионнаяКарточкаРегистрационныйНомер = Неопределено;
		Форма.Объект.ЛицензионнаяКарточкаСерия                = Неопределено;
		Форма.Объект.уатVIN                                   = "";
		Форма.Объект.уатНомерДвигателя                        = "";
		Форма.Объект.уатНомерКузова                           = "";
		Форма.Объект.уатНомерШасси                            = "";
		Форма.Объект.уатНомерКПП                              = "";
		Форма.Объект.уатОбъектЭксплуатации                    = Неопределено;
		Форма.Объект.уатКодПоКлассификатору                   = Неопределено;
		Форма.Объект.уатБалансоваяСтоимость                   = 0;
		Форма.Объект.уатСрокИспользования                     = 0;
		Форма.Объект.уатИДвСистемеНавигации                   = "";
		Форма.Объект.уатИспользуемаяСистемаGPS                = Перечисления.уатСистемаGPS.ПустаяСсылка();
		Форма.Объект.уатКоэффициентИзмененияНормТоплива       = 0;
	КонецЕсли;
	
	// Команды шаблонов наименований.
	кНастроитьШаблон = Форма.Команды.Добавить("_уатТранспортныеСредстваНастроитьШаблон");
	кНастроитьШаблон.Заголовок                 = "Настройки";
	кНастроитьШаблон.Действие                  = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	кНастроитьШаблон.ИзменяетСохраняемыеДанные = Истина;
	кНастроитьШаблон.Картинка                  = БиблиотекаКартинок.уатНастроитьШаблон;
	кНастроитьШаблон.Подсказка                 = "Настроить шаблон";
	кНастроитьШаблон.Отображение               = ОтображениеКнопки.КартинкаИТекст;
	
	ЭлементКнНастроитьШаблон = Форма.Элементы.Добавить("_уатТранспортныеСредстваНастроитьШаблон", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	ЭлементКнНастроитьШаблон.ИмяКоманды = "_уатТранспортныеСредстваНастроитьШаблон";
	
	кСформироватьНаименование = Форма.Команды.Добавить("_уатТранспортныеСредстваСформироватьНаименование");
	кСформироватьНаименование.Заголовок                 = "Сформировать наименование";
	кСформироватьНаименование.Действие                  = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	кСформироватьНаименование.ИзменяетСохраняемыеДанные = Истина;
	кСформироватьНаименование.Картинка                  = БиблиотекаКартинок.уатАвтоматическоеФормированиеНаименования;
	кСформироватьНаименование.Подсказка                 = "Сформировать наименование";
	кСформироватьНаименование.Отображение               = ОтображениеКнопки.Картинка;
	
	гГруппаНаименование = Форма.Элементы.Добавить("_ГруппаНаименованиеУАТ", Тип("ГруппаФормы"));
	гГруппаНаименование.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	гГруппаНаименование.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	гГруппаНаименование.Отображение         = ОтображениеОбычнойГруппы.Нет;
	гГруппаНаименование.ОтображатьЗаголовок = Ложь;
	
	Форма.Элементы.Переместить(гГруппаНаименование, Форма, Форма.Элементы.Наименование);
	Форма.Элементы.Переместить(Форма.Элементы.Наименование, гГруппаНаименование);
	
	ЭлементКнСформироватьНаименование = Форма.Элементы.Добавить("_уатТранспортныеСредстваСформироватьНаименование", Тип("КнопкаФормы"), гГруппаНаименование);
	ЭлементКнСформироватьНаименование.ИмяКоманды = "_уатТранспортныеСредстваСформироватьНаименование";
	
КонецПроцедуры

Процедура ТранспортныеСредстваФормаВыбораПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	ГруппаРазмещения = Форма.Элементы.Найти("Список");
	Если ГруппаРазмещения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЭлементГосНомер = Форма.Элементы.Добавить("Код", Тип("ПолеФормы"), ГруппаРазмещения);
	ЭлементГосНомер.Вид         = ВидПоляФормы.ПолеНадписи;
	ЭлементГосНомер.ПутьКДанным = "Список.Код";
	ЭлементГосНомер.Заголовок   = "Гос. номер";
	
	ЭлементГаражныйНомер = Форма.Элементы.Добавить("уатГаражныйНомер", Тип("ПолеФормы"), ГруппаРазмещения);
	ЭлементГаражныйНомер.Вид         = ВидПоляФормы.ПолеНадписи;
	ЭлементГаражныйНомер.ПутьКДанным = "Список.уатГаражныйНомер";
	
	ЭлементОрганизация = Форма.Элементы.Добавить("уатОрганизация", Тип("ПолеФормы"), ГруппаРазмещения);
	ЭлементОрганизация.Вид         = ВидПоляФормы.ПолеНадписи;
	ЭлементОрганизация.ПутьКДанным = "Список.уатОрганизация";
	
	ЭлементКолонна = Форма.Элементы.Добавить("уатКолонна", Тип("ПолеФормы"), ГруппаРазмещения);
	ЭлементКолонна.Вид         = ВидПоляФормы.ПолеНадписи;
	ЭлементКолонна.ПутьКДанным = "Список.уатКолонна";
	
	ЭлементПодразделение = Форма.Элементы.Добавить("уатПодразделение", Тип("ПолеФормы"), ГруппаРазмещения);
	ЭлементПодразделение.Вид         = ВидПоляФормы.ПолеНадписи;
	ЭлементПодразделение.ПутьКДанным = "Список.уатПодразделение";
	
	ЭлементМодель = Форма.Элементы.Добавить("уатМодель", Тип("ПолеФормы"), ГруппаРазмещения);
	ЭлементМодель.Вид         = ВидПоляФормы.ПолеНадписи;
	ЭлементМодель.ПутьКДанным = "Список.уатМодель";
	
	ЭлементТип = Форма.Элементы.Добавить("Тип", Тип("ПолеФормы"), ГруппаРазмещения);
	ЭлементТип.Вид         = ВидПоляФормы.ПолеНадписи;
	ЭлементТип.ПутьКДанным = "Список.Тип";
	
КонецПроцедуры

Процедура УзлыОбъектовЭксплуатацииФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	// Вывод на форму гиперссылки для перехода к форме реквизитов модуля УАТ.
	ЭлементГСФормаУАТТС = Форма.Элементы.Добавить("_уатФормаДопСвойствУзловОбъектовЭксплуатации", Тип("ДекорацияФормы"), Форма);
	ЭлементГСФормаУАТТС.Заголовок   = "Дополнительные реквизиты модуля ""Управление автотранспортом""";
	ЭлементГСФормаУАТТС.Вид         = ВидДекорацииФормы.Надпись;
	ЭлементГСФормаУАТТС.Гиперссылка = Истина;
	ЭлементГСФормаУАТТС.Подсказка   = "Открыть форму дополнительных реквизитов модуля ""Управление автотранспортом"".";
	ЭлементГСФормаУАТТС.УстановитьДействие("Нажатие", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
	ЭлементГСФормаУАТТС.АвтоМаксимальнаяШирина = Ложь;
	
	// Команды шаблонов наименований.
	кНастроитьШаблон = Форма.Команды.Добавить("_уатУзлыОбъектовЭксплуатацииНастроитьШаблон");
	кНастроитьШаблон.Заголовок                 = "Настройки";
	кНастроитьШаблон.Действие                  = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	кНастроитьШаблон.ИзменяетСохраняемыеДанные = Истина;
	кНастроитьШаблон.Картинка                  = БиблиотекаКартинок.уатНастроитьШаблон;
	кНастроитьШаблон.Подсказка                 = "Настроить шаблон";
	кНастроитьШаблон.Отображение               = ОтображениеКнопки.КартинкаИТекст;
	
	ЭлементКнНастроитьШаблон = Форма.Элементы.Добавить("_уатУзлыОбъектовЭксплуатацииНастроитьШаблон", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	ЭлементКнНастроитьШаблон.ИмяКоманды = "_уатУзлыОбъектовЭксплуатацииНастроитьШаблон";
	
	// Если объект доступен для редактирования.
	Если Не Форма.ВладелецЛиквидирован И Форма.Редактируется И Не Форма.ТолькоПросмотр Тогда 
		// Добавление кнопки для заполнения наименования по данным УАТ.
		гГруппаНаименование = Форма.Элементы.Добавить("_ГруппаНаименованиеУАТ", Тип("ГруппаФормы"), Форма.Элементы.ГруппаРеквизитыШапкиЛево);
		гГруппаНаименование.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
		гГруппаНаименование.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		гГруппаНаименование.Отображение         = ОтображениеОбычнойГруппы.Нет;
		гГруппаНаименование.ОтображатьЗаголовок = Ложь;
		
		Форма.Элементы.Переместить(Форма.Элементы.Наименование, гГруппаНаименование);
		
		кСформироватьНаименование = Форма.Команды.Добавить("_уатУзлыОбъектовЭксплуатацииСформироватьНаименование");
		кСформироватьНаименование.Заголовок                 = "Сформировать наименование";
		кСформироватьНаименование.Действие                  = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
		кСформироватьНаименование.ИзменяетСохраняемыеДанные = Истина;
		кСформироватьНаименование.Картинка                  = БиблиотекаКартинок.уатАвтоматическоеФормированиеНаименования;
		кСформироватьНаименование.Подсказка                 = "Сформировать наименование";
		кСформироватьНаименование.Отображение               = ОтображениеКнопки.Картинка;
		
		ЭлементКнСформироватьНаименование = Форма.Элементы.Добавить("_уатУзлыОбъектовЭксплуатацииСформироватьНаименование", Тип("КнопкаФормы"), гГруппаНаименование);
		ЭлементКнСформироватьНаименование.ИмяКоманды = "_уатУзлыОбъектовЭксплуатацииСформироватьНаименование";
		
		Форма.Элементы.Переместить(гГруппаНаименование, Форма.Элементы.ГруппаРеквизитыШапкиЛево, Форма.Элементы.НаименованиеПолное);
		
		// Добавление кнопки для заполнения модели по данным УАТ.
		гГруппаМодель = Форма.Элементы.Добавить("_ГруппаМодельУАТ", Тип("ГруппаФормы"), Форма.Элементы.ГруппаОсновныеРеквизиты);
		гГруппаМодель.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
		гГруппаМодель.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		гГруппаМодель.Отображение         = ОтображениеОбычнойГруппы.Нет;
		гГруппаМодель.ОтображатьЗаголовок = Ложь;
		
		Форма.Элементы.Переместить(Форма.Элементы.Модель, гГруппаМодель);
		
		кЗаполнитьМодель = Форма.Команды.Добавить("_уатУзелОбъектовЭксплуатацииЗаполнитьМодельПоДаннымУАТ");
		кЗаполнитьМодель.Заголовок                 = "Заполнить по данным УАТ";
		кЗаполнитьМодель.Действие                  = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
		кЗаполнитьМодель.ИзменяетСохраняемыеДанные = Истина;
		кЗаполнитьМодель.Картинка                  = БиблиотекаКартинок.ПереместитьВлево;
		кЗаполнитьМодель.Подсказка                 = "Заполнить модель по данным УАТ";
		кЗаполнитьМодель.Отображение               = ОтображениеКнопки.Картинка;
		
		ЭлементКнЗаполнитьМодель = Форма.Элементы.Добавить("_уатУзелОбъектовЭксплуатацииЗаполнитьМодельПоДаннымУАТ", Тип("КнопкаФормы"), гГруппаМодель);
		ЭлементКнЗаполнитьМодель.ИмяКоманды  = "_уатУзелОбъектовЭксплуатацииЗаполнитьМодельПоДаннымУАТ";
		
		Форма.Элементы.Переместить(гГруппаМодель, Форма.Элементы.ГруппаОсновныеРеквизиты, Форма.Элементы.СерийныйНомер);
	КонецЕсли;
	
КонецПроцедуры

#Область ЗаполнениеТабеляПоДаннымПЛ

Функция ТабельНоваяСтрокаДанныхОВремени(ДанныеОВремени, Сотрудник, НомерСтрокиСотрудник, ВысотаСтроки)
	СтрокиПоСотруднику = Новый Массив;
	
	НоваяСтрока = ДанныеОВремени.Добавить();
	НоваяСтрока.Сотрудник = Сотрудник;
	НоваяСтрока.НомерСтрокиСотрудник = НомерСтрокиСотрудник;
	НоваяСтрока.ЭтоПерваяСтрокаПоСотруднику = Истина;
	НоваяСтрока.ЧетнаяСтрока = (НомерСтрокиСотрудник % 2 = 0); 
	НоваяСтрока.ПустаяСтрока = Истина;
	
	СтрокиПоСотруднику.Добавить(НоваяСтрока);
	
	Для Сч = 2 По ВысотаСтроки Цикл
		НоваяСтрока = ДанныеОВремени.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник;
		НоваяСтрока.НомерСтрокиСотрудник = НомерСтрокиСотрудник;
		НоваяСтрока.ЭтоПерваяСтрокаПоСотруднику = Ложь;
		НоваяСтрока.ЧетнаяСтрока = (НомерСтрокиСотрудник % 2 = 0); 
		НоваяСтрока.ПустаяСтрока = Истина;
		
		СтрокиПоСотруднику.Добавить(НоваяСтрока);
	КонецЦикла;	
	
	Возврат СтрокиПоСотруднику;
КонецФункции

Процедура ТабельЗаполнитьСтрокиПоСотруднику(Объект, ДанныеОВремениПоСотруднику, МассивСтрокПоСотруднику, КодыВидовВремени, ОписаниеВидовВремени, ВысотаСтроки)
	
	ВидВремениРабочееВремя = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя");
	
	ОбрабатываемаяДата = '00010101';	

	ОМ_УчетРабочегоВремениРасширенныйКлиентСервер = ОбщегоНазначения.ОбщийМодуль("УчетРабочегоВремениРасширенныйКлиентСервер");
	
	НормаЧасов = 0;
	МаксимальноеКоличествоВидовВремени = 0;
	МаксимальноеКоличествоЧасовНаДату = -1;
	ВидВремениПоУмолчанию = Неопределено;
	Для Каждого СтрокаДанныхОВремени Из ДанныеОВремениПоСотруднику Цикл
		Если СтрокаДанныхОВремени.ВидУчетаВремени = ВидВремениРабочееВремя Тогда
			Продолжить;
		КонецЕсли;	
		
		Если СтрокаДанныхОВремени.Дата <> ОбрабатываемаяДата Тогда 
			НомерДня = День(СтрокаДанныхОВремени.Дата);	
			НомерВидаВремениНаДату = 1;
			
			Если ВидВремениПоУмолчанию <> Неопределено Тогда
				МассивСтрокПоСотруднику[0]["ВидВремениПоУмолчаниюОбозначение" + День(ОбрабатываемаяДата)] = КодыВидовВремени.Получить(ВидВремениПоУмолчанию);	
			КонецЕсли;	
		Иначе
			НомерВидаВремениНаДату = НомерВидаВремениНаДату + 1;
		КонецЕсли;
		
		Если НомерВидаВремениНаДату > МассивСтрокПоСотруднику.Количество() Тогда
			СтрокаТабеля = ОМ_УчетРабочегоВремениРасширенныйКлиентСервер.ТабельНоваяСтрокаПоСотруднику(Объект.ДанныеОВремени, МассивСтрокПоСотруднику[0]);	
			МассивСтрокПоСотруднику.Добавить(СтрокаТабеля);
		Иначе
			СтрокаТабеля = МассивСтрокПоСотруднику[НомерВидаВремениНаДату - 1];		
		КонецЕсли;	
		
		СтрокаТабеля["ВидВремени" + НомерДня] = СтрокаДанныхОВремени.ВидУчетаВремени;
		СтрокаТабеля["Часов" + НомерДня] = СтрокаТабеля["Часов" + НомерДня] + СтрокаДанныхОВремени.Часы;
		
		Если НомерВидаВремениНаДату = 1 Тогда
			СтрокаТабеля["ЧасовНорма" + НомерДня] = СтрокаДанныхОВремени.НормаЧасов;
		КонецЕсли;	
				
		БуквенноеОбозначение = КодыВидовВремени.Получить(СтрокаДанныхОВремени.ВидУчетаВремени);
		
		СтрокаТабеля["Время" + НомерДня + "Представление"] = ОМ_УчетРабочегоВремениРасширенныйКлиентСервер.ТабельПредставлениеВремениПоВиду(БуквенноеОбозначение, СтрокаТабеля["Часов" + НомерДня]);  
		СтрокаТабеля.ПустаяСтрока = Ложь;
		
		ОбрабатываемаяДата = СтрокаДанныхОВремени.Дата;
		МаксимальноеКоличествоВидовВремени = Макс(МаксимальноеКоличествоВидовВремени, НомерВидаВремениНаДату);
		
		Если СтрокаДанныхОВремени.Часы > МаксимальноеКоличествоЧасовНаДату Тогда
			ВидВремениПоУмолчанию = СтрокаДанныхОВремени.ВидУчетаВремени;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если ВидВремениПоУмолчанию <> Неопределено И ОбрабатываемаяДата <> '00010101' Тогда
		МассивСтрокПоСотруднику[0]["ВидВремениПоУмолчаниюОбозначение" + День(ОбрабатываемаяДата)] = КодыВидовВремени.Получить(ВидВремениПоУмолчанию);	
	КонецЕсли;	
	
	КоличествоСтрокПоСотруднику = МассивСтрокПоСотруднику.Количество();
	
	Сотрудник = МассивСтрокПоСотруднику[0].Сотрудник;
	
	Для Каждого СтрокаПоСотруднику Из МассивСтрокПоСотруднику Цикл
		СтрокаПоСотруднику.Сотрудник = Сотрудник;		
	КонецЦикла;	
		
	ВысотаСтроки = Макс(ВысотаСтроки, МаксимальноеКоличествоВидовВремени);
	
	ОбозначенияВидовВремени = ОМ_УчетРабочегоВремениРасширенныйКлиентСервер.ТабельОбозначенияВидовВремени(ОписаниеВидовВремени);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
